MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAS176/mcu.h
extern volatile __C2FIFOCON30bits_t C2FIFOCON30bits __asm__ ("C2FIFOCON30") __attribute__((section("sfrs"), address(0xBF881AD0)));
extern volatile uint32_t        C2FIFOCON30CLR __attribute__((section("sfrs"),address(0xBF881AD4)));
extern volatile uint32_t        C2FIFOCON30SET __attribute__((section("sfrs"),address(0xBF881AD8)));
extern volatile uint32_t        C2FIFOCON30INV __attribute__((section("sfrs"),address(0xBF881ADC)));
#define C2FIFOINT30 C2FIFOINT30
extern volatile uint32_t   C2FIFOINT30 __attribute__((section("sfrs"), address(0xBF881AE0)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT30bits_t;
extern volatile __C2FIFOINT30bits_t C2FIFOINT30bits __asm__ ("C2FIFOINT30") __attribute__((section("sfrs"), address(0xBF881AE0)));
extern volatile uint32_t        C2FIFOINT30CLR __attribute__((section("sfrs"),address(0xBF881AE4)));
extern volatile uint32_t        C2FIFOINT30SET __attribute__((section("sfrs"),address(0xBF881AE8)));
extern volatile uint32_t        C2FIFOINT30INV __attribute__((section("sfrs"),address(0xBF881AEC)));
#define C2FIFOUA30 C2FIFOUA30
extern volatile uint32_t   C2FIFOUA30 __attribute__((section("sfrs"), address(0xBF881AF0)));
extern volatile uint32_t        C2FIFOUA30CLR __attribute__((section("sfrs"),address(0xBF881AF4)));
extern volatile uint32_t        C2FIFOUA30SET __attribute__((section("sfrs"),address(0xBF881AF8)));
extern volatile uint32_t        C2FIFOUA30INV __attribute__((section("sfrs"),address(0xBF881AFC)));
#define C2FIFOCI30 C2FIFOCI30
extern volatile uint32_t   C2FIFOCI30 __attribute__((section("sfrs"), address(0xBF881B00)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI30bits_t;
extern volatile __C2FIFOCI30bits_t C2FIFOCI30bits __asm__ ("C2FIFOCI30") __attribute__((section("sfrs"), address(0xBF881B00)));
extern volatile uint32_t        C2FIFOCI30CLR __attribute__((section("sfrs"),address(0xBF881B04)));
extern volatile uint32_t        C2FIFOCI30SET __attribute__((section("sfrs"),address(0xBF881B08)));
extern volatile uint32_t        C2FIFOCI30INV __attribute__((section("sfrs"),address(0xBF881B0C)));
#define C2FIFOCON31 C2FIFOCON31
extern volatile uint32_t   C2FIFOCON31 __attribute__((section("sfrs"), address(0xBF881B10)));
typedef union {
  struct {
    uint32_t TXPRI:2;
    uint32_t RTREN:1;
    uint32_t TXREQ:1;
    uint32_t TXERR:1;
    uint32_t TXLARB:1;
    uint32_t TXABAT:1;
    uint32_t TXEN:1;
    uint32_t :4;
    uint32_t DONLY:1;
    uint32_t UINC:1;
    uint32_t FRESET:1;
    uint32_t :1;
    uint32_t FSIZE:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCON31bits_t;
extern volatile __C2FIFOCON31bits_t C2FIFOCON31bits __asm__ ("C2FIFOCON31") __attribute__((section("sfrs"), address(0xBF881B10)));
extern volatile uint32_t        C2FIFOCON31CLR __attribute__((section("sfrs"),address(0xBF881B14)));
extern volatile uint32_t        C2FIFOCON31SET __attribute__((section("sfrs"),address(0xBF881B18)));
extern volatile uint32_t        C2FIFOCON31INV __attribute__((section("sfrs"),address(0xBF881B1C)));
#define C2FIFOINT31 C2FIFOINT31
extern volatile uint32_t   C2FIFOINT31 __attribute__((section("sfrs"), address(0xBF881B20)));
typedef union {
  struct {
    uint32_t RXNEMPTYIF:1;
    uint32_t RXHALFIF:1;
    uint32_t RXFULLIF:1;
    uint32_t RXOVFLIF:1;
    uint32_t :4;
    uint32_t TXEMPTYIF:1;
    uint32_t TXHALFIF:1;
    uint32_t TXNFULLIF:1;
    uint32_t :5;
    uint32_t RXNEMPTYIE:1;
    uint32_t RXHALFIE:1;
    uint32_t RXFULLIE:1;
    uint32_t RXOVFLIE:1;
    uint32_t :4;
    uint32_t TXEMPTYIE:1;
    uint32_t TXHALFIE:1;
    uint32_t TXNFULLIE:1;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOINT31bits_t;
extern volatile __C2FIFOINT31bits_t C2FIFOINT31bits __asm__ ("C2FIFOINT31") __attribute__((section("sfrs"), address(0xBF881B20)));
extern volatile uint32_t        C2FIFOINT31CLR __attribute__((section("sfrs"),address(0xBF881B24)));
extern volatile uint32_t        C2FIFOINT31SET __attribute__((section("sfrs"),address(0xBF881B28)));
extern volatile uint32_t        C2FIFOINT31INV __attribute__((section("sfrs"),address(0xBF881B2C)));
#define C2FIFOUA31 C2FIFOUA31
extern volatile uint32_t   C2FIFOUA31 __attribute__((section("sfrs"), address(0xBF881B30)));
extern volatile uint32_t        C2FIFOUA31CLR __attribute__((section("sfrs"),address(0xBF881B34)));
extern volatile uint32_t        C2FIFOUA31SET __attribute__((section("sfrs"),address(0xBF881B38)));
extern volatile uint32_t        C2FIFOUA31INV __attribute__((section("sfrs"),address(0xBF881B3C)));
#define C2FIFOCI31 C2FIFOCI31
extern volatile uint32_t   C2FIFOCI31 __attribute__((section("sfrs"), address(0xBF881B40)));
typedef union {
  struct {
    uint32_t CFIFOCI:5;
  };
  struct {
    uint32_t w:32;
  };
} __C2FIFOCI31bits_t;
extern volatile __C2FIFOCI31bits_t C2FIFOCI31bits __asm__ ("C2FIFOCI31") __attribute__((section("sfrs"), address(0xBF881B40)));
extern volatile uint32_t        C2FIFOCI31CLR __attribute__((section("sfrs"),address(0xBF881B44)));
extern volatile uint32_t        C2FIFOCI31SET __attribute__((section("sfrs"),address(0xBF881B48)));
extern volatile uint32_t        C2FIFOCI31INV __attribute__((section("sfrs"),address(0xBF881B4C)));
#define ETHCON1 ETHCON1
extern volatile uint32_t   ETHCON1 __attribute__((section("sfrs"), address(0xBF882000)));
typedef union {
  struct {
    uint32_t BUFCDEC:1;
    uint32_t :3;
    uint32_t MANFC:1;
    uint32_t :2;
    uint32_t AUTOFC:1;
    uint32_t RXEN:1;
    uint32_t TXRTS:1;
    uint32_t :3;
    uint32_t SIDL:1;
    uint32_t :1;
    uint32_t ON:1;
    uint32_t PTV:16;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON1bits_t;
extern volatile __ETHCON1bits_t ETHCON1bits __asm__ ("ETHCON1") __attribute__((section("sfrs"), address(0xBF882000)));
extern volatile uint32_t        ETHCON1CLR __attribute__((section("sfrs"),address(0xBF882004)));
extern volatile uint32_t        ETHCON1SET __attribute__((section("sfrs"),address(0xBF882008)));
extern volatile uint32_t        ETHCON1INV __attribute__((section("sfrs"),address(0xBF88200C)));
#define ETHCON2 ETHCON2
extern volatile uint32_t   ETHCON2 __attribute__((section("sfrs"), address(0xBF882010)));
typedef union {
  struct {
    uint32_t :4;
    uint32_t RXBUF_SZ:7;
  };
  struct {
    uint32_t w:32;
  };
} __ETHCON2bits_t;
extern volatile __ETHCON2bits_t ETHCON2bits __asm__ ("ETHCON2") __attribute__((section("sfrs"), address(0xBF882010)));
extern volatile uint32_t        ETHCON2CLR __attribute__((section("sfrs"),address(0xBF882014)));
extern volatile uint32_t        ETHCON2SET __attribute__((section("sfrs"),address(0xBF882018)));
extern volatile uint32_t        ETHCON2INV __attribute__((section("sfrs"),address(0xBF88201C)));
#define ETHTXST ETHTXST
extern volatile uint32_t   ETHTXST __attribute__((section("sfrs"), address(0xBF882020)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t TXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHTXSTbits_t;
extern volatile __ETHTXSTbits_t ETHTXSTbits __asm__ ("ETHTXST") __attribute__((section("sfrs"), address(0xBF882020)));
extern volatile uint32_t        ETHTXSTCLR __attribute__((section("sfrs"),address(0xBF882024)));
extern volatile uint32_t        ETHTXSTSET __attribute__((section("sfrs"),address(0xBF882028)));
extern volatile uint32_t        ETHTXSTINV __attribute__((section("sfrs"),address(0xBF88202C)));
#define ETHRXST ETHRXST
extern volatile uint32_t   ETHRXST __attribute__((section("sfrs"), address(0xBF882030)));
typedef union {
  struct {
    uint32_t :2;
    uint32_t RXSTADDR:30;
  };
  struct {
    uint32_t w:32;
  };
} __ETHRXSTbits_t;
extern volatile __ETHRXSTbits_t ETHRXSTbits __asm__ ("ETHRXST") __attribute__((section("sfrs"), address(0xBF882030)));
extern volatile uint32_t        ETHRXSTCLR __attribute__((section("sfrs"),address(0xBF882034)));
extern volatile uint32_t        ETHRXSTSET __attribute__((section("sfrs"),address(0xBF882038)));
extern volatile uint32_t        ETHRXSTINV __attribute__((section("sfrs"),address(0xBF88203C)));
#define ETHHT0 ETHHT0
extern volatile uint32_t   ETHHT0 __attribute__((section("sfrs"), address(0xBF882040)));
typedef union {
  struct {
    uint32_t w:32;
  };
  struct {
    uint32_t HTLOWER:32;
  };
} __ETHHT0bits_t;
