MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAS176/mcu.h
extern volatile __AUBADEVCFG2bits_t AUBADEVCFG2bits __asm__ ("AUBADEVCFG2") __attribute__((section("sfrs"), address(0xBFC2FF44)));
#define AUBADEVCFG1 AUBADEVCFG1
extern volatile uint32_t   AUBADEVCFG1 __attribute__((section("sfrs"), address(0xBFC2FF48)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG1bits_t;
extern volatile __AUBADEVCFG1bits_t AUBADEVCFG1bits __asm__ ("AUBADEVCFG1") __attribute__((section("sfrs"), address(0xBFC2FF48)));
#define AUBADEVCFG0 AUBADEVCFG0
extern volatile uint32_t   AUBADEVCFG0 __attribute__((section("sfrs"), address(0xBFC2FF4C)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCTYPE:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t :24;
    uint32_t POSCAGCDLY:2;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCFG0bits_t;
extern volatile __AUBADEVCFG0bits_t AUBADEVCFG0bits __asm__ ("AUBADEVCFG0") __attribute__((section("sfrs"), address(0xBFC2FF4C)));
#define AUBADEVCP3 AUBADEVCP3
extern volatile uint32_t   AUBADEVCP3 __attribute__((section("sfrs"), address(0xBFC2FF50)));
#define AUBADEVCP2 AUBADEVCP2
extern volatile uint32_t   AUBADEVCP2 __attribute__((section("sfrs"), address(0xBFC2FF54)));
#define AUBADEVCP1 AUBADEVCP1
extern volatile uint32_t   AUBADEVCP1 __attribute__((section("sfrs"), address(0xBFC2FF58)));
#define AUBADEVCP0 AUBADEVCP0
extern volatile uint32_t   AUBADEVCP0 __attribute__((section("sfrs"), address(0xBFC2FF5C)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __AUBADEVCP0bits_t;
extern volatile __AUBADEVCP0bits_t AUBADEVCP0bits __asm__ ("AUBADEVCP0") __attribute__((section("sfrs"), address(0xBFC2FF5C)));
#define AUBADEVSIGN3 AUBADEVSIGN3
extern volatile uint32_t   AUBADEVSIGN3 __attribute__((section("sfrs"), address(0xBFC2FF60)));
#define AUBADEVSIGN2 AUBADEVSIGN2
extern volatile uint32_t   AUBADEVSIGN2 __attribute__((section("sfrs"), address(0xBFC2FF64)));
#define AUBADEVSIGN1 AUBADEVSIGN1
extern volatile uint32_t   AUBADEVSIGN1 __attribute__((section("sfrs"), address(0xBFC2FF68)));
#define AUBADEVSIGN0 AUBADEVSIGN0
extern volatile uint32_t   AUBADEVSIGN0 __attribute__((section("sfrs"), address(0xBFC2FF6C)));
#define AUBASEQ3 AUBASEQ3
extern volatile uint32_t   AUBASEQ3 __attribute__((section("sfrs"), address(0xBFC2FF70)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __AUBASEQ3bits_t;
extern volatile __AUBASEQ3bits_t AUBASEQ3bits __asm__ ("AUBASEQ3") __attribute__((section("sfrs"), address(0xBFC2FF70)));
#define AUBASEQ2 AUBASEQ2
extern volatile uint32_t   AUBASEQ2 __attribute__((section("sfrs"), address(0xBFC2FF74)));
#define AUBASEQ1 AUBASEQ1
extern volatile uint32_t   AUBASEQ1 __attribute__((section("sfrs"), address(0xBFC2FF78)));
#define AUBASEQ0 AUBASEQ0
extern volatile uint32_t   AUBASEQ0 __attribute__((section("sfrs"), address(0xBFC2FF7C)));
#define UBADEVCFG4 UBADEVCFG4
extern volatile uint32_t   UBADEVCFG4 __attribute__((section("sfrs"), address(0xBFC2FFBC)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t SWDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG4bits_t;
extern volatile __UBADEVCFG4bits_t UBADEVCFG4bits __asm__ ("UBADEVCFG4") __attribute__((section("sfrs"), address(0xBFC2FFBC)));
#define UBADEVCFG3 UBADEVCFG3
extern volatile uint32_t   UBADEVCFG3 __attribute__((section("sfrs"), address(0xBFC2FFC0)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG3bits_t;
extern volatile __UBADEVCFG3bits_t UBADEVCFG3bits __asm__ ("UBADEVCFG3") __attribute__((section("sfrs"), address(0xBFC2FFC0)));
#define UBADEVCFG2 UBADEVCFG2
extern volatile uint32_t   UBADEVCFG2 __attribute__((section("sfrs"), address(0xBFC2FFC4)));
typedef union {
  struct {
    uint32_t FPLLIDIV:3;
    uint32_t :1;
    uint32_t FPLLRNG:3;
    uint32_t FPLLICLK:1;
    uint32_t FPLLMULT:7;
    uint32_t :1;
    uint32_t FPLLODIV:3;
    uint32_t VBATBOREN:1;
    uint32_t DSBOREN:1;
    uint32_t DSWDTPS:5;
    uint32_t DSWDTOSC:1;
    uint32_t DSWDTEN:1;
    uint32_t FDSEN:1;
    uint32_t :1;
    uint32_t UPLLFSEL:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG2bits_t;
extern volatile __UBADEVCFG2bits_t UBADEVCFG2bits __asm__ ("UBADEVCFG2") __attribute__((section("sfrs"), address(0xBFC2FFC4)));
#define UBADEVCFG1 UBADEVCFG1
extern volatile uint32_t   UBADEVCFG1 __attribute__((section("sfrs"), address(0xBFC2FFC8)));
typedef union {
  struct {
    uint32_t FNOSC:3;
    uint32_t DMTINTV:3;
    uint32_t FSOSCEN:1;
    uint32_t IESO:1;
    uint32_t POSCMOD:2;
    uint32_t OSCIOFNC:1;
    uint32_t :3;
    uint32_t FCKSM:2;
    uint32_t WDTPS:5;
    uint32_t WDTSPGM:1;
    uint32_t WINDIS:1;
    uint32_t FWDTEN:1;
    uint32_t FWDTWINSZ:2;
    uint32_t DMTCNT:5;
    uint32_t FDMTEN:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG1bits_t;
extern volatile __UBADEVCFG1bits_t UBADEVCFG1bits __asm__ ("UBADEVCFG1") __attribute__((section("sfrs"), address(0xBFC2FFC8)));
#define UBADEVCFG0 UBADEVCFG0
extern volatile uint32_t   UBADEVCFG0 __attribute__((section("sfrs"), address(0xBFC2FFCC)));
typedef union {
  struct {
    uint32_t DEBUG:2;
    uint32_t JTAGEN:1;
    uint32_t ICESEL:2;
    uint32_t TRCEN:1;
    uint32_t BOOTISA:1;
    uint32_t :1;
    uint32_t FECCCON:2;
    uint32_t FSLEEP:1;
    uint32_t :1;
    uint32_t DBGPER:3;
    uint32_t SMCLR:1;
    uint32_t SOSCGAIN:2;
    uint32_t SOSCBOOST:1;
    uint32_t POSCGAIN:2;
    uint32_t POSCBOOST:1;
    uint32_t POSCFGAIN:2;
    uint32_t POSCTYPE:2;
    uint32_t POSCAGCRNG:1;
    uint32_t POSCAGC:1;
    uint32_t :2;
    uint32_t EJTAGBEN:1;
  };
  struct {
    uint32_t :24;
    uint32_t POSCAGCDLY:2;
  };
  struct {
    uint32_t FDEBUG:2;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCFG0bits_t;
extern volatile __UBADEVCFG0bits_t UBADEVCFG0bits __asm__ ("UBADEVCFG0") __attribute__((section("sfrs"), address(0xBFC2FFCC)));
#define UBADEVCP3 UBADEVCP3
extern volatile uint32_t   UBADEVCP3 __attribute__((section("sfrs"), address(0xBFC2FFD0)));
#define UBADEVCP2 UBADEVCP2
extern volatile uint32_t   UBADEVCP2 __attribute__((section("sfrs"), address(0xBFC2FFD4)));
#define UBADEVCP1 UBADEVCP1
extern volatile uint32_t   UBADEVCP1 __attribute__((section("sfrs"), address(0xBFC2FFD8)));
#define UBADEVCP0 UBADEVCP0
extern volatile uint32_t   UBADEVCP0 __attribute__((section("sfrs"), address(0xBFC2FFDC)));
typedef union {
  struct {
    uint32_t :28;
    uint32_t CP:1;
  };
  struct {
    uint32_t w:32;
  };
} __UBADEVCP0bits_t;
extern volatile __UBADEVCP0bits_t UBADEVCP0bits __asm__ ("UBADEVCP0") __attribute__((section("sfrs"), address(0xBFC2FFDC)));
#define UBADEVSIGN3 UBADEVSIGN3
extern volatile uint32_t   UBADEVSIGN3 __attribute__((section("sfrs"), address(0xBFC2FFE0)));
#define UBADEVSIGN2 UBADEVSIGN2
extern volatile uint32_t   UBADEVSIGN2 __attribute__((section("sfrs"), address(0xBFC2FFE4)));
#define UBADEVSIGN1 UBADEVSIGN1
extern volatile uint32_t   UBADEVSIGN1 __attribute__((section("sfrs"), address(0xBFC2FFE8)));
#define UBADEVSIGN0 UBADEVSIGN0
extern volatile uint32_t   UBADEVSIGN0 __attribute__((section("sfrs"), address(0xBFC2FFEC)));
#define UBASEQ3 UBASEQ3
extern volatile uint32_t   UBASEQ3 __attribute__((section("sfrs"), address(0xBFC2FFF0)));
typedef union {
  struct {
    uint32_t TSEQ:16;
    uint32_t CSEQ:16;
  };
  struct {
    uint32_t w:32;
  };
} __UBASEQ3bits_t;
extern volatile __UBASEQ3bits_t UBASEQ3bits __asm__ ("UBASEQ3") __attribute__((section("sfrs"), address(0xBFC2FFF0)));
#define UBASEQ2 UBASEQ2
extern volatile uint32_t   UBASEQ2 __attribute__((section("sfrs"), address(0xBFC2FFF4)));
#define UBASEQ1 UBASEQ1
extern volatile uint32_t   UBASEQ1 __attribute__((section("sfrs"), address(0xBFC2FFF8)));
#define UBASEQ0 UBASEQ0
extern volatile uint32_t   UBASEQ0 __attribute__((section("sfrs"), address(0xBFC2FFFC)));
#define ABF1DEVCFG4 ABF1DEVCFG4
extern volatile uint32_t   ABF1DEVCFG4 __attribute__((section("sfrs"), address(0xBFC4FF3C)));
typedef union {
  struct {
    uint32_t :24;
    uint32_t SWDTPS:5;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG4bits_t;
extern volatile __ABF1DEVCFG4bits_t ABF1DEVCFG4bits __asm__ ("ABF1DEVCFG4") __attribute__((section("sfrs"), address(0xBFC4FF3C)));
#define ABF1DEVCFG3 ABF1DEVCFG3
extern volatile uint32_t   ABF1DEVCFG3 __attribute__((section("sfrs"), address(0xBFC4FF40)));
typedef union {
  struct {
    uint32_t USERID:16;
    uint32_t :8;
    uint32_t FMIIEN:1;
    uint32_t FETHIO:1;
    uint32_t :1;
    uint32_t PGL1WAY:1;
    uint32_t PMDL1WAY:1;
    uint32_t IOL1WAY:1;
  };
  struct {
    uint32_t w:32;
  };
} __ABF1DEVCFG3bits_t;
