MikroElektronika/core_packages/PIC32/XC32/def/PIC32MZ1064DAS176/mcu.h
#define _EBIMSK3_MEMSIZE_POSITION                0x00000000
#define _EBIMSK3_MEMSIZE_MASK                    0x0000001F
#define _EBIMSK3_MEMSIZE_LENGTH                  0x00000005

#define _EBIMSK3_MEMTYPE_POSITION                0x00000005
#define _EBIMSK3_MEMTYPE_MASK                    0x000000E0
#define _EBIMSK3_MEMTYPE_LENGTH                  0x00000003

#define _EBIMSK3_REGSEL_POSITION                 0x00000008
#define _EBIMSK3_REGSEL_MASK                     0x00000700
#define _EBIMSK3_REGSEL_LENGTH                   0x00000003

#define _EBISMT0_TRC_POSITION                    0x00000000
#define _EBISMT0_TRC_MASK                        0x0000003F
#define _EBISMT0_TRC_LENGTH                      0x00000006

#define _EBISMT0_TAS_POSITION                    0x00000006
#define _EBISMT0_TAS_MASK                        0x000000C0
#define _EBISMT0_TAS_LENGTH                      0x00000002

#define _EBISMT0_TWR_POSITION                    0x00000008
#define _EBISMT0_TWR_MASK                        0x00000300
#define _EBISMT0_TWR_LENGTH                      0x00000002

#define _EBISMT0_TWP_POSITION                    0x0000000A
#define _EBISMT0_TWP_MASK                        0x0000FC00
#define _EBISMT0_TWP_LENGTH                      0x00000006

#define _EBISMT0_TBTA_POSITION                   0x00000010
#define _EBISMT0_TBTA_MASK                       0x00070000
#define _EBISMT0_TBTA_LENGTH                     0x00000003

#define _EBISMT0_TPRC_POSITION                   0x00000013
#define _EBISMT0_TPRC_MASK                       0x00780000
#define _EBISMT0_TPRC_LENGTH                     0x00000004

#define _EBISMT0_PAGEMODE_POSITION               0x00000017
#define _EBISMT0_PAGEMODE_MASK                   0x00800000
#define _EBISMT0_PAGEMODE_LENGTH                 0x00000001

#define _EBISMT0_PAGESIZE_POSITION               0x00000018
#define _EBISMT0_PAGESIZE_MASK                   0x03000000
#define _EBISMT0_PAGESIZE_LENGTH                 0x00000002

#define _EBISMT0_RDYMODE_POSITION                0x0000001A
#define _EBISMT0_RDYMODE_MASK                    0x04000000
#define _EBISMT0_RDYMODE_LENGTH                  0x00000001

#define _EBISMT1_TRC_POSITION                    0x00000000
#define _EBISMT1_TRC_MASK                        0x0000003F
#define _EBISMT1_TRC_LENGTH                      0x00000006

#define _EBISMT1_TAS_POSITION                    0x00000006
#define _EBISMT1_TAS_MASK                        0x000000C0
#define _EBISMT1_TAS_LENGTH                      0x00000002

#define _EBISMT1_TWR_POSITION                    0x00000008
#define _EBISMT1_TWR_MASK                        0x00000300
#define _EBISMT1_TWR_LENGTH                      0x00000002

#define _EBISMT1_TWP_POSITION                    0x0000000A
#define _EBISMT1_TWP_MASK                        0x0000FC00
#define _EBISMT1_TWP_LENGTH                      0x00000006

#define _EBISMT1_TBTA_POSITION                   0x00000010
#define _EBISMT1_TBTA_MASK                       0x00070000
#define _EBISMT1_TBTA_LENGTH                     0x00000003

#define _EBISMT1_TPRC_POSITION                   0x00000013
#define _EBISMT1_TPRC_MASK                       0x00780000
#define _EBISMT1_TPRC_LENGTH                     0x00000004

#define _EBISMT1_PAGEMODE_POSITION               0x00000017
#define _EBISMT1_PAGEMODE_MASK                   0x00800000
#define _EBISMT1_PAGEMODE_LENGTH                 0x00000001

#define _EBISMT1_PAGESIZE_POSITION               0x00000018
#define _EBISMT1_PAGESIZE_MASK                   0x03000000
#define _EBISMT1_PAGESIZE_LENGTH                 0x00000002

#define _EBISMT1_RDYMODE_POSITION                0x0000001A
#define _EBISMT1_RDYMODE_MASK                    0x04000000
#define _EBISMT1_RDYMODE_LENGTH                  0x00000001

#define _EBISMT2_TRC_POSITION                    0x00000000
#define _EBISMT2_TRC_MASK                        0x0000003F
#define _EBISMT2_TRC_LENGTH                      0x00000006

#define _EBISMT2_TAS_POSITION                    0x00000006
#define _EBISMT2_TAS_MASK                        0x000000C0
#define _EBISMT2_TAS_LENGTH                      0x00000002

#define _EBISMT2_TWR_POSITION                    0x00000008
#define _EBISMT2_TWR_MASK                        0x00000300
#define _EBISMT2_TWR_LENGTH                      0x00000002

#define _EBISMT2_TWP_POSITION                    0x0000000A
#define _EBISMT2_TWP_MASK                        0x0000FC00
#define _EBISMT2_TWP_LENGTH                      0x00000006

#define _EBISMT2_TBTA_POSITION                   0x00000010
#define _EBISMT2_TBTA_MASK                       0x00070000
#define _EBISMT2_TBTA_LENGTH                     0x00000003

#define _EBISMT2_TPRC_POSITION                   0x00000013
#define _EBISMT2_TPRC_MASK                       0x00780000
#define _EBISMT2_TPRC_LENGTH                     0x00000004

#define _EBISMT2_PAGEMODE_POSITION               0x00000017
#define _EBISMT2_PAGEMODE_MASK                   0x00800000
#define _EBISMT2_PAGEMODE_LENGTH                 0x00000001

#define _EBISMT2_PAGESIZE_POSITION               0x00000018
#define _EBISMT2_PAGESIZE_MASK                   0x03000000
#define _EBISMT2_PAGESIZE_LENGTH                 0x00000002

#define _EBISMT2_RDYMODE_POSITION                0x0000001A
#define _EBISMT2_RDYMODE_MASK                    0x04000000
#define _EBISMT2_RDYMODE_LENGTH                  0x00000001

#define _EBIFTRPD_TRPD_POSITION                  0x00000000
#define _EBIFTRPD_TRPD_MASK                      0xFFFFFFFF
#define _EBIFTRPD_TRPD_LENGTH                    0x00000020

#define _EBISMCON_SMRP_POSITION                  0x00000000
#define _EBISMCON_SMRP_MASK                      0x00000001
#define _EBISMCON_SMRP_LENGTH                    0x00000001

#define _EBISMCON_SMDWIDTH0_POSITION             0x00000007
#define _EBISMCON_SMDWIDTH0_MASK                 0x00000380
#define _EBISMCON_SMDWIDTH0_LENGTH               0x00000003

#define _EBISMCON_SMDWIDTH1_POSITION             0x0000000A
#define _EBISMCON_SMDWIDTH1_MASK                 0x00001C00
#define _EBISMCON_SMDWIDTH1_LENGTH               0x00000003

#define _EBISMCON_SMDWIDTH2_POSITION             0x0000000D
#define _EBISMCON_SMDWIDTH2_MASK                 0x0000E000
#define _EBISMCON_SMDWIDTH2_LENGTH               0x00000003

#define _SQI1XCON1_TYPECMD_POSITION              0x00000000
#define _SQI1XCON1_TYPECMD_MASK                  0x00000003
#define _SQI1XCON1_TYPECMD_LENGTH                0x00000002

